---
kind: property
id: P:Autodesk.Revit.DB.RuledFace.IsExtruded
source: html/cf640b08-f8ba-dcff-b4be-385ebff98ee2.htm
---
# Autodesk.Revit.DB.RuledFace.IsExtruded Property

Determines if this is an extruded ruled surface.

## Syntax (C#)
```csharp
public bool IsExtruded { get; }
```